examples/ctrlflowgraph/ctrl_switch3.cpp.dot
digraph {
	fontname="SansSerif,sans-serif" labeljust=l nojustify=true ranksep=0.35
	node [fillcolor="#fefece" fontname="SansSerif,sans-serif" fontsize=10 height=0.35 shape=box style="filled, rounded"]
	subgraph cluster_item_0 {
		graph [label="::main() -> int"]
		item_1 [label="return ::calc_val(0)" fillcolor=lightgreen]
		item_2 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_1 -> item_2
	}
	subgraph cluster_item_3 {
		graph [label="::calc_val(int const param) -> int"]
		item_4 [label="int value = 0"]
		item_5 [label="int val2 = 0"]
		item_4 -> item_5
		subgraph cluster_item_6 {
			graph [label="switch:"]
			switch_start_item_7 [label=param ordering=out shape=hexagon style=filled]
			"gotolabel_@71" [label=0 shape=cds style=filled]
			"gotolabel_@71" [label=0 shape=cds style=filled]
			switch_start_item_7 -> "gotolabel_@71" [label=0]
			"gotolabel_@73" [label=1 shape=cds style=filled]
			"gotolabel_@73" [label=1 shape=cds style=filled]
			switch_start_item_7 -> "gotolabel_@73" [label=1]
			"gotolabel_@76" [label="default:" fillcolor=lightgreen shape=cds style=filled]
			switch_start_item_7 -> "gotolabel_@76" [label="default:"]
			item_8 [label="value = value + 10"]
			"gotolabel_@71" -> item_8
			item_8 -> "gotolabel_@73"
			switch_anchor_item_9 [label="" height=0.0 margin=0 shape=none style="" width=0.0]
			item_8 -> switch_anchor_item_9 [style=invis]
			item_10 [label="value & 1 == 0" shape=hexagon style=filled]
			"gotolabel_@106" [label=2 shape=cds style=filled]
			item_11 [label="value = value + 100"]
			"gotolabel_@106" -> item_11
			item_12 [label="value = value + 1000"]
			item_12 -> "gotolabel_@96"
			item_10 -> "gotolabel_@106" [label=true]
			item_11 -> item_13
			item_10 -> item_12 [label=false]
			item_13 [label="" height=0.2 shape=diamond style=filled width=0.2]
			item_14 [label="val2 = val2 + 1"]
			item_13 -> item_14
			"gotolabel_@73" -> item_10
			item_14 -> "gotolabel_@76"
			switch_anchor_item_15 [label="" height=0.0 margin=0 shape=none style="" width=0.0]
			item_14 -> switch_anchor_item_15 [style=invis]
			item_16 [label="val2 = val2 + 10"]
			"gotolabel_@76" -> item_16
			switch_anchor_item_17 [label="" height=0.0 margin=0 shape=none style="" width=0.0]
			item_16 -> switch_anchor_item_17 [style=invis]
			switch_start_item_7 -> "gotolabel_@106" [label=2]
			"gotolabel_@96" [label="" height=0.2 ordering=in shape=diamond style=filled width=0.2]
			item_16 -> "gotolabel_@96"
			switch_anchor_item_9 -> "gotolabel_@96" [style=invis]
			switch_anchor_item_15 -> "gotolabel_@96" [style=invis]
			switch_anchor_item_17 -> "gotolabel_@96" [style=invis]
			{
				rank=same
				"gotolabel_@71"
				"gotolabel_@73"
				"gotolabel_@76"
			}
			{
				rank=same
				switch_anchor_item_9
				switch_anchor_item_15
				switch_anchor_item_17
			}
			switch_anchor_item_9 -> switch_anchor_item_15 [style=invis]
			switch_anchor_item_15 -> switch_anchor_item_17 [style=invis]
		}
		item_5 -> switch_start_item_7
		item_18 [label="return value" fillcolor=lightgreen]
		item_19 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_18 -> item_19
		"gotolabel_@96" -> item_18
	}
	item_2 -> item_4 [style=invis]
}
